Tekla.Structures.ModelInternal.RebarEndDetailStrip
The rebar end detail strip.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarEndDetailStrip class.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.CloneStrip
Clones the end detail strip.
Returns: The cloned end detail strip.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.ToStruct(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The to struct method.
dotStrip: The dotRebarEndDetailStrip_t struct.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.FromStruct(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The from struct method.
dotStrip: The dotRebarEndDetailStrip_t struct.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.RebarHookData
Gets the rebar hook data.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.RebarThreading
Gets the rebar threading.